// i18n.js (или любой файл конфигурации i18next)
import i18n from 'i18next';
import { initReactI18next } from 'react-i18next';

i18n.use(initReactI18next).init({
  resources: {
    en: {
      translation: {
        "Главная": "Home",
        "Уведомления": "Notifications",
        "О нас": "About Us",
        "Корзина": "Basket",
        "Создать товар": "Create Product",
        "Панель Администратора": "Admin Panel",
        "Вход": "Login",
        "Регистрация": "Register",
        "Выйти": "Logout",
        "privacyPolicy": "Privacy Policy",
        "termsOfUse": "Terms of Use",
        "contacts": "Contacts",
        "allRightsReserved": "All rights reserved.",
        "searchPlaceholder": "Search for products...",
        "allProducts": "All Products",
        "allProductsInBrand": "All products from {{brand}}",
        "selectType": "Select type",
        "types": "Types",
        "brands": "Brands",
        "noProducts": "No products available!",
        "back": "Back",
        "forward": "Next",
        "testProduct": "Product is a test item", 
        "grid": "Grid view",
        "list": "List view",
        "Корзина": "Basket",
        "Ваша корзина пуста!": "Your basket is empty!",
        "Цена": "Price:",
        "Удалить из корзины": "Remove from basket",
        "Общая сумма": "Total amount:",
        "Basket": "Basket",
        "Your basket is empty!": "Your basket is empty!",
        "Price:": "Price:",
        "Remove from basket": "Remove from basket",
        "Total amount:": "Total amount:",
        "Цена:": "Price:",
        "Номер поставщика:": "Supplier number:",
        "Добавить в корзину": "Add to basket",
        "Описание товара": "Product Description",
        "Характеристики": "Specifications",
        "Сохранить изменения": "Save changes",
        "Редактировать": "Edit",
        "Удалить устройство": "Delete device",
        "Приносим свои извинения!": "We apologize!",
        "С искренней благодарностью за ваше терпение и понимание! Мы в OptiTradeHub глубоко ценим вашу поддержку в этот период развития нашего проекта. Хотя наш сайт все еще находится в бета-версии, ваша обратная связь и отзывы неоценимы для нас.":
          "With sincere gratitude for your patience and understanding! At OptiTradeHub, we deeply appreciate your support during this development phase of our project. Although our site is still in beta, your feedback and reviews are invaluable to us.",
        "Мы стремимся к созданию уникального и удобного пространства для вас, наших пользователей. Ваше мнение помогает нам не только исправлять ошибки, но и делать наш сервис лучше каждый день.":
          "We strive to create a unique and convenient space for you, our users. Your opinion helps us not only to fix mistakes but also to improve our service every day.",
        "Приносим искренние извинения за любые неудобства, с которыми вы могли столкнуться. Наша команда работает не покладая рук, чтобы создать для вас неповторимый опыт использования OptiTradeHub.":
          "We sincerely apologize for any inconvenience you may have encountered. Our team is working tirelessly to create a unique experience for you on OptiTradeHub.",
        "Пожалуйста, имейте в виду, что данный функционал находится в разработке, и мы активно работаем над его реализацией.":
          "Please note that this functionality is under development, and we are actively working on its implementation.",
        "Еще раз, большое спасибо за ваше терпение, понимание и поддержку!":
          "Once again, thank you very much for your patience, understanding, and support!",
        "Напишите нам и сообщите об ошибке!": "Write to us and report the error!",
        
     
      },
    },
    ru: {
      translation: {
        "Главная": "Главная",
        "Уведомления": "Уведомления",
        "О нас": "О нас",
        "Корзина": "Корзина",
        "Создать товар": "Создать товар",
        "Панель Администратора": "Панель Администратора",
        "Вход": "Вход",
        "Регистрация": "Регистрация",
        "Выйти": "Выйти",
        "privacyPolicy": "Политика конфиденциальности",
        "termsOfUse": "Условия использования",
        "contacts": "Контакты",
        "allRightsReserved": "Все права защищены.",
        "searchPlaceholder": "Поиск товаров...",
        "allProducts": "Все товары",
        "allProductsInBrand": "Все товары {{brand}}",
        "selectType": "Выберите тип",
        "types": "Типы",
        "brands": "Бренды",
        "noProducts": "Товаров пока нет!",
        "back": "Назад",
        "forward": "Вперед",
        "testProduct": "Товар является тестовым",
        "grid": "Вид сетки",
        "list": "Вид списка",
        "Basket": "Корзина",
        "Your basket is empty!": "Ваша корзина пуста!",
        "Price:": "Цена:",
        "Remove from basket": "Удалить из корзины",
        "Total amount:": "Общая сумма:",
        "Цена:": "Цена:",
        "Номер поставщика:": "Номер поставщика:",
        "Добавить в корзину": "Добавить в корзину",
        "Описание товара": "Описание товара",
        "Характеристики": "Характеристики",
        "Сохранить изменения": "Сохранить изменения",
        "Редактировать": "Редактировать",
        "Удалить устройство": "Удалить устройство",
        "Приносим свои извинения!": "Приносим свои извинения!",
        "С искренней благодарностью за ваше терпение и понимание! Мы в OptiTradeHub глубоко ценим вашу поддержку в этот период развития нашего проекта. Хотя наш сайт все еще находится в бета-версии, ваша обратная связь и отзывы неоценимы для нас.":
          "С искренней благодарностью за ваше терпение и понимание! Мы в OptiTradeHub глубоко ценим вашу поддержку в этот период развития нашего проекта. Хотя наш сайт все еще находится в бета-версии, ваша обратная связь и отзывы неоценимы для нас.",
        "Мы стремимся к созданию уникального и удобного пространства для вас, наших пользователей. Ваше мнение помогает нам не только исправлять ошибки, но и делать наш сервис лучше каждый день.":
          "Мы стремимся к созданию уникального и удобного пространства для вас, наших пользователей. Ваше мнение помогает нам не только исправлять ошибки, но и делать наш сервис лучше каждый день.",
        "Приносим искренние извинения за любые неудобства, с которыми вы могли столкнуться. Наша команда работает не покладая рук, чтобы создать для вас неповторимый опыт использования OptiTradeHub.":
          "Приносим искренние извинения за любые неудобства, с которыми вы могли столкнуться. Наша команда работает не покладая рук, чтобы создать для вас неповторимый опыт использования OptiTradeHub.",
        "Пожалуйста, имейте в виду, что данный функционал находится в разработке, и мы активно работаем над его реализацией.":
          "Пожалуйста, имейте в виду, что данный функционал находится в разработке, и мы активно работаем над его реализацией.",
        "Еще раз, большое спасибо за ваше терпение, понимание и поддержку!":
          "Еще раз, большое спасибо за ваше терпение, понимание и поддержку!",
        "Напишите нам и сообщите об ошибке!": "Напишите нам и сообщите об ошибке!",
     
      },
    },
    kz: {
      translation: {
        "Главная": "Басты",
        "Уведомления": "Хабарламалар",
        "О нас": "Біз туралы",
        "Корзина": "Себет",
        "Создать товар": "Өнім жасау",
        "Панель Администратора": "Админ панелі",
        "Вход": "Кіру",
        "Регистрация": "Тіркелу",
        "Выйти": "Шығу",
        "privacyPolicy": "Жекешелік саясат",
        "termsOfUse": "Пайдалану шарттары",
        "contacts": "Байланыстар",
        "allRightsReserved": "Барлық құқықтар қорғалған.",
        "searchPlaceholder": "Тауарларды іздеу...",
        "allProducts": "Барлық тауарлар",
        "allProductsInBrand": "Барлық тауарлар {{brand}}",
        "selectType": "Типті таңдаңыз",
        "types": "Типтер",
        "brands": "Брендтер",
        "noProducts": "Тауар жоқ!",
        "back": "Артқа",
        "forward": "Алға",
        "testProduct": "Тауар сынақ зат",
        "grid": "Тор көрінісі",
        "list": "Тізім көрінісі",
        "Basket": "Себет",
        "Your basket is empty!": "Себетіңіз бос!",
        "Price:": "Бағасы:",
        "Remove from basket": "Себеттен жою",
        "Total amount:": "Жалпы сома:",
        "Цена:": "Бағасы:",
        "Номер поставщика:": "Жеткізуші нөмірі:",
        "Добавить в корзину": "Себетке қосу",
        "Описание товара": "Өнімнің сипаттамасы",
        "Характеристики": "Ерекшеліктер",
        "Сохранить изменения": "Өзгерістерді сақтау",
        "Редактировать": "Түзету",
        "Удалить устройство": "Құрылғыны жою",
        "Приносим свои извинения!": "Кешіріңіздер!",
        "С искренней благодарностью за ваше терпение и понимание! Мы в OptiTradeHub глубоко ценим вашу поддержку в этот период развития нашего проекта. Хотя наш сайт все еще находится в бета-версии, ваша обратная связь и отзывы неоценимы для нас.":
          "Сіздің шыдамдылығыңыз бен түсінігіңіз үшін шын жүректен алғысымызды білдіреміз! OptiTradeHub-та біз жоба дамуының осы кезеңінде сіздің қолдауыңызды жоғары бағалаймыз. Біздің сайт әлі бета-нұсқада болғанымен, сіздің пікірлеріңіз бен шолуларыңыз біздің үшін өте құнды.",
        "Мы стремимся к созданию уникального и удобного пространства для вас, наших пользователей. Ваше мнение помогает нам не только исправлять ошибки, но и делать наш сервис лучше каждый день.":
          "Біз сіздер, біздің пайдаланушыларымыз үшін бірегей және ыңғайлы кеңістік құруға ұмтыламыз. Сіздің пікіріңіз бізге қателерді түзетуге ғана емес, сонымен қатар біздің қызметімізді күн сайын жақсартуға көмектеседі.",
        "Приносим искренние извинения за любые неудобства, с которыми вы могли столкнуться. Наша команда работает не покладая рук, чтобы создать для вас неповторимый опыт использования OptiTradeHub.":
          "Кездескен кез келген қолайсыздықтар үшін шын жүректен кешірім сұраймыз. Біздің команда сіздер үшін OptiTradeHub-ты пайдаланудың ерекше тәжірибесін жасау үшін тынымсыз жұмыс істейді.",
        "Пожалуйста, имейте в виду, что данный функционал находится в разработке, и мы активно работаем над его реализацией.":
          "Осы функционал әзірленуде екенін және біз оның іске асырылуымен белсенді жұмыс істеп жатқанымызды ескеріңіз.",
        "Еще раз, большое спасибо за ваше терпение, понимание и поддержку!":
          "Тағы да, шыдамдылығыңыз, түсінігіңіз бен қолдауыңыз үшін көп рахмет!",
        "Напишите нам и сообщите об ошибке!": "Бізге жазыңыз және қателік туралы хабарлаңыз!",
     
      },
    },
  },
  lng: 'ru', // Язык по умолчанию
  fallbackLng: 'ru',

  interpolation: {
    escapeValue: false,
  },
});

export default i18n;
